tutorials/blastFoam/forwardStep/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

// Note: these are the properties for a "normalised" inviscid gas
//       for which the speed of sound is 1 m/s at a temperature of 1K
//       and gamma = 7/5
mixture
{
    specie
    {
        molWeight       11640.3;
    }
    thermodynamics
    {
        Cp              2.5;
        Hf              0;
    }
    transport
    {
        mu              0;
        Pr              1;
    }
}*/

type basic;
thermoType
{
    transport const;
    thermo eConst;
    equationOfState idealGas;
};
equationOfState
{
    gamma       1.4;
}

specie
{
    molWeight    11640.3;
}
transport
{
    mu              0;              // Viscosity
    Pr              1;              // Prandtl number
}
thermodynamics
{
    type        eConst;
  //  Cp          2.5;
    Cv          1.785714286;           // Heat capacity
    Hf          0.0;
}
// ************************************************************************* //
