tutorials/blastFoam/forwardStep/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoU|rhoE|alpha)"
    {
        solver          diagonal;
    }
    "(rho|rhoU|rhoE|alpha)Final"
    {
        solver          diagonal;
    }

    "(U|e)"
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|e)Final"
    {
        $U;
        relTol          0;
    }
}


// ************************************************************************* //
